# Здесь выбираем комплилятор и флаги (вывод ошибок, если что-то пойдет не так, стандарт языка и тд)
compiler = gcc
cflags = -Wall -Wextra -std=c11 -Iinclude

# Тут производим поиск всех .с файлов в папке с кодом, после чего компилируем их по отдельности
code = $(wildcard code/*.c)
obj = $(code:.c=.o)

# Выбираем имя скомпилированной программы
target = nes-emulator

# Здесь собираем основную программу из скомпилированных файлов в предыдущем шаге
$(target): $(obj)
	$(compiler) $(cflags) -o $(target) $(obj)
    
# Убираем за собой :)
clean:
	rm -f $(obj) $(target)

.PHONY: clean